Revit 2027 API
BuiltInFailures.StructuralCustomConnectionFailures.StructuralCannotCreateCustomConnection Property
 Could not create a custom connection.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId StructuralCannotCreateCustomConnection { get; }
Public Shared ReadOnly Property StructuralCannotCreateCustomConnection As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ StructuralCannotCreateCustomConnection {
	FailureDefinitionId^ get ();
}
static member StructuralCannotCreateCustomConnection : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StructuralCustomConnectionFailures Class
Autodesk.Revit.DB Namespace